novaeco/n32r16/sensor_node/configs/esp32s2/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s2"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP32S2_DEFAULT_CPU_FREQ_240=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="../partitions/esp32s2_8MB.csv"
CONFIG_SPIRAM_USE_CAPS_ALLOC=n
CONFIG_FREERTOS_UNICORE=y
